InformationRegisters/абс_НастройкиОповещения/абс_НастройкиОповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_НастройкиОповещения</name>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипОповещения</name>
    <type>
      <types>EnumRef.абс_ТипыОповещений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/абс_ТипыОповещений/абс_ТипыОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ТипыОповещений</name>
  <enumValues>
    <name>ОкончаниеДействияСертификатов</name>
  </enumValues>
  <enumValues>
    <name>РассылкаПоСтоплисту</name>
  </enumValues>
  <enumValues>
    <name>РассылкаБлокировкиЗаказа</name>
  </enumValues>
  <enumValues>
    <name>РассылкаИзменениеЗаказа</name>
  </enumValues>
  <enumValues>
    <name>РассылкаНеотгруженныйТовар</name>
  </enumValues>
  <enumValues>
    <name>РассылкаОтчетаПоЗапасам</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСпецификацийИТехкарт</name>
  </enumValues>
</mdclass:Enum>

Documents/абс_СертификатНаТовары/абс_СертификатНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_СертификатНаТовары</name>
  <registerRecords>InformationRegister.абс_ТоварыСертификатов</registerRecords>
  <attributes>
    <name>ДатаНачалаДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Неактуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганСертификации</name>
    <type>
      <types>CatalogRef.абс_ОрганыСертификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСертификата</name>
    <type>
      <types>EnumRef.абс_ВидыСертификатовНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлСертификата</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ПоказательЭффективности</name>
    <type>
      <types>EnumRef.Лео_ОКК_СоответствиеПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ДатазаписиВБазу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НоменклатураСертификата</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Catalogs/УчетныеЗаписиЭлектроннойПочты/УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиЭлектроннойПочты</name>
  <predefined>
    <items>
      <name>СистемнаяУчетнаяЗаписьЭлектроннойПочты</name>
      <description>Системная учетная запись электронной почты</description>
    </items>
    <items>
      <name>УведомленияДистрибуции</name>
      <description>Уведомления дистрибуции</description>
    </items>
  </predefined>
  <attributes>
    <name>SMTPСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>POP3Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортSMTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортPOP3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяSMTPАутентификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжиданияСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОставлятьКопииСообщенийНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПисьмаССервераЧерез</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейУдаленияПисемССервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВходящие</name>
    <type>
      <types>CatalogRef.ГруппыПисемЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсходящие</name>
    <type>
      <types>CatalogRef.ГруппыПисемЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаУдаленные</name>
    <type>
      <types>CatalogRef.ГруппыПисемЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЧерновики</name>
    <type>
      <types>CatalogRef.ГруппыПисемЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНежелательные</name>
    <type>
      <types>CatalogRef.ГруппыПисемЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматТекстаПисьмаПоУмолчанию</name>
    <type>
      <types>EnumRef.ВидыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПодписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьПодписьКИсходящимПисьмам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьПодписьКОтветамИПересылкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоПолучениеОтправкаСообщений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалАвтоПолученияОтправкиСообщений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаАвтоПолучениеОтправкуСообщений</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПомещатьОтветыИПереадресацииВТужеГруппу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеАвтополученияОтправкиСообщений</name>
    <type>
      <types>EnumRef.ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяУстановкаПометкиРассмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалАвтоматическойУстановкиОтметкиРассмотрено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяУстановкаПометкиРассмотреноПриОтвете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяУстановкаПометкиРассмотреноПриПолученииОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКлассификациюПисемПоПредметам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьПустойПредметДляНовыхПисемИзТемыПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьПредмет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьОснованиеНовогоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьГруппуПисемНовогоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтосохранениеПисем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалАвтосохраненияПисем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматПисьмаДляОтветовИПереадресацийБратьИзИсходного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаПисемПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкуПисьмаДляОтветовБратьИзИсходного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьОбъектыИзАдресовПервогоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеУчетнойЗаписи</name>
    <type>
      <types>EnumRef.НазначенияУчетнойЗаписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <comment>И</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступКУчетнойЗаписи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Администрирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Запись</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

CommonModules/абс_РегламентныеЗадания/Module.bsl
Процедура абс_ОповещениеПользователей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_НастройкиОповещения.ТипОповещения,
	|	абс_НастройкиОповещения.Действует,
	|	абс_НастройкиОповещения.АдресЭлектроннойПочты
	|ИЗ
	|	РегистрСведений.абс_НастройкиОповещения КАК абс_НастройкиОповещения
	|ГДЕ
	|	абс_НастройкиОповещения.Действует
	|	И абс_НастройкиОповещения.ТипОповещения = ЗНАЧЕНИЕ(Перечисление.абс_ТипыОповещений.ОкончаниеДействияСертификатов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипОповещения = Перечисления.абс_ТипыОповещений.ОкончаниеДействияСертификатов И Не Выборка.АдресЭлектроннойПочты= "" Тогда
			ВыполнитьРассылкуОбОкончанииДействияСертификатов(Выборка.АдресЭлектроннойПочты);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьРассылкуОбОкончанииДействияСертификатов(АдресЭлектроннойПочты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_СертификатНаТовары.Номер,
	|	абс_СертификатНаТовары.Дата,
	|	абс_СертификатНаТовары.ВидСертификата
	|ИЗ
	|	Документ.абс_СертификатНаТовары КАК абс_СертификатНаТовары
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(абс_СертификатНаТовары.ДатаОкончанияДействияСертификата, ДЕНЬ) = &ТекущаяДата
	|	И абс_СертификатНаТовары.ПометкаУдаления = ЛОЖЬ
	|	И абс_СертификатНаТовары.Проведен = ИСТИНА
	|	И абс_СертификатНаТовары.Неактуальный = ЛОЖЬ";
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПисьма = Формат(ТекущаяДата(),"ДФ=""дд.ММ.гггг""")+" заканчивается срок действия следующих сертификатов: <BR> <BR>";
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекстПисьма = ТекстПисьма + Строка(Выборка.ВидСертификата) + " №" + Выборка.Номер + " от " + Формат(Выборка.Дата, "ДФ=""дд.ММ.гггг""") + " <BR>";
		
	КонецЦикла;
		
	//отправка
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	СтруктураПараметров.Вставить("Тема", "Оповещение об окончании действия сертификатов");
	СтруктураПараметров.Вставить("Тело", ТекстПисьма);
	МассивАдресов = абс_УправлениеДебиторскойЗадолженностью.РазобратьСтрокуВМассивПоРазделителю(АдресЭлектроннойПочты, ",");
	СписокКому = Новый СписокЗначений;
	СписокКому.ЗагрузитьЗначения(МассивАдресов);
	СтруктураПараметров.Вставить("Кому",СписокКому);
	
	СтруктураПисьма = УправлениеЭлектроннойПочтой.НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"),СтруктураПараметров,,,,,, Истина, Ложь);
	
	ЭлектронныеПисьма = Новый Соответствие;
	
	ЭлектронныеПисьма.Вставить(СтруктураПисьма.ПисьмоСсылка);
	
	ИзмененныйСоставПисем = Новый Соответствие;	
	ТекущийПользователь= глЗначениеПеременной("глТекущийПользователь");	
	ДоступныеУчетныеЗаписи = УправлениеЭлектроннойПочтой.ПолучитьДоступныеУчетныеЗаписи(ТекущийПользователь);
	Для каждого Письмо Из ЭлектронныеПисьма Цикл
		Если ТипЗнч(Письмо.Значение) <> Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
			ОбъектПисьмо = Письмо.Ключ.ПолучитьОбъект();
			
			ОбъектПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			Если НЕ ЗначениеЗаполнено(ОбъектПисьмо.Ответственный) Тогда
				ОбъектПисьмо.Ответственный = ТекущийПользователь;
			КонецЕсли; 
		
			Попытка
				ОбъектПисьмо.Записать();
			Исключение
				Продолжить;;
			КонецПопытки;
		Иначе
			Письмо.Значение.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			Если НЕ ЗначениеЗаполнено(Письмо.Значение.Ответственный) Тогда
				Письмо.Значение.Ответственный = ТекущийПользователь;
			КонецЕсли; 
		КонецЕсли; 
	    ИзмененныйСоставПисем.Вставить(Письмо.Ключ, Письмо.Значение);  		
	КонецЦикла;
	
	УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), ПараметрыСеанса.ТекущийПользователь,,
									ИзмененныйСоставПисем, Истина , , Ложь, );
	
КонецПроцедуры

Процедура абс_ОбработкаСтопЛиста() Экспорт
	
	//Обновим статусы в стоп листе
	ТаблицаСтопЛиста = абс_УправлениеДебиторскойЗадолженностью.ПолучитьТаблицуСтопЛиста();
	абс_УправлениеДебиторскойЗадолженностью.УстановитьСтатусыСтопЛиста(ТаблицаСтопЛиста);
	
КонецПроцедуры

Процедура абс_РассылкаСтопЛиста() Экспорт
	
	МассивФайлов = Новый Массив;
	МассивКонтрагентов = Новый Массив;
	
	абс_УправлениеДебиторскойЗадолженностью.СформироватьОтчетСтопЛист(МассивФайлов, МассивКонтрагентов);
	
	Если МассивФайлов.Количество()>0 Тогда
		абс_УправлениеДебиторскойЗадолженностью.ВыполнитьРассылкуОтчетаСтопЛист(МассивФайлов, МассивКонтрагентов);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьОтчетПродажиТопыркинЛеотон() Экспорт
	Если 0 + Лев(ТекущаяДата(),2) <= 5 Тогда
		
		// Отчет снимается с 1-го по 5-е число
		
		// 1-е число позапрошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Месяц перед позапрошлым месяцем	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-3), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	Если 0 + Лев(ТекущаяДата(),2) > 5 Тогда
		
		// Отчет снимается после 5-го числа 
		
		// 1-е число прошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Позапрошлый месяц	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	//ЛефЭкспо
	
		Если 0 + Лев(ТекущаяДата(),2) <= 5 Тогда
		
		// Отчет снимается с 1-го по 5-е число
		
		// 1-е число позапрошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Месяц перед позапрошлым месяцем	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-3), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	Если 0 + Лев(ТекущаяДата(),2) > 5 Тогда
		
		// Отчет снимается после 5-го числа 
		
		// 1-е число прошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Позапрошлый месяц	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	//Леовит
	
		Если 0 + Лев(ТекущаяДата(),2) <= 5 Тогда
		
		// Отчет снимается с 1-го по 5-е число
		
		// 1-е число позапрошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7713204095"); //Леовит
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leovit_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Месяц перед позапрошлым месяцем	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7713204095"); //Леовит
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leovit_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-3), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	Если 0 + Лев(ТекущаяДата(),2) > 5 Тогда
		
		// Отчет снимается после 5-го числа 
		
		// 1-е число прошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7713204095");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leovit_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Позапрошлый месяц	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7713204095");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leovit_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	


КонецПроцедуры	                                                        

//231030 Степан ++
Процедура лео_ИзменениеСпецификацийИТехкарт(СпецификацияТехКарта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_НастройкиОповещения.ТипОповещения,
	|	абс_НастройкиОповещения.Действует,
	|	абс_НастройкиОповещения.АдресЭлектроннойПочты
	|ИЗ
	|	РегистрСведений.абс_НастройкиОповещения КАК абс_НастройкиОповещения
	|ГДЕ
	|	абс_НастройкиОповещения.Действует
	|	И абс_НастройкиОповещения.ТипОповещения = ЗНАЧЕНИЕ(Перечисление.абс_ТипыОповещений.ИзменениеСпецификацийИТехкарт)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.АдресЭлектроннойПочты = "" Тогда
			ВыполнитьРассылкуОбИзмененииСпецификацийИТехкарт(Выборка.АдресЭлектроннойПочты, СпецификацияТехКарта);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьРассылкуОбИзмененииСпецификацийИТехкарт(АдресЭлектроннойПочты, СпецификацияТехКарта)
	
	ТекстПисьма = Формат(ТекущаяДата(),"ДФ=""дд.ММ.гггг""")+" внесены изменения в: <BR> <BR>";
	ТекстПисьма = ТекстПисьма + Сред(ТипЗнч(СпецификацияТехКарта),20) + " " + СпецификацияТехКарта + " <BR>";
		
	//отправка
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	СтруктураПараметров.Вставить("Тема", "Внесены изменения в "+СпецификацияТехКарта);
	СтруктураПараметров.Вставить("Тело", ТекстПисьма);
	МассивАдресов = абс_УправлениеДебиторскойЗадолженностью.РазобратьСтрокуВМассивПоРазделителю(АдресЭлектроннойПочты, ",");

	СписокКому = Новый СписокЗначений;
	СписокКому.ЗагрузитьЗначения(МассивАдресов);
	СтруктураПараметров.Вставить("Кому",СписокКому);
	
	СтруктураПисьма = УправлениеЭлектроннойПочтой.НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"),СтруктураПараметров,,,,,, Истина, Ложь);
	
	ЭлектронныеПисьма = Новый Соответствие;
	
	ЭлектронныеПисьма.Вставить(СтруктураПисьма.ПисьмоСсылка);
	
	ИзмененныйСоставПисем = Новый Соответствие;	
	ТекущийПользователь= глЗначениеПеременной("глТекущийПользователь");	
	ДоступныеУчетныеЗаписи = УправлениеЭлектроннойПочтой.ПолучитьДоступныеУчетныеЗаписи(ТекущийПользователь);
	Для каждого Письмо Из ЭлектронныеПисьма Цикл
		Если ТипЗнч(Письмо.Значение) <> Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
			ОбъектПисьмо = Письмо.Ключ.ПолучитьОбъект();
			
			ОбъектПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			Если НЕ ЗначениеЗаполнено(ОбъектПисьмо.Ответственный) Тогда
				ОбъектПисьмо.Ответственный = ТекущийПользователь;
			КонецЕсли; 
		
			Попытка
				ОбъектПисьмо.Записать();
			Исключение
				Продолжить;;
			КонецПопытки;
		Иначе
			Письмо.Значение.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			Если НЕ ЗначениеЗаполнено(Письмо.Значение.Ответственный) Тогда
				Письмо.Значение.Ответственный = ТекущийПользователь;
			КонецЕсли; 
		КонецЕсли; 
	    ИзмененныйСоставПисем.Вставить(Письмо.Ключ, Письмо.Значение);  		
	КонецЦикла;
	
	УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), ПараметрыСеанса.ТекущийПользователь,,
									ИзмененныйСоставПисем, Истина , , Ложь, );
	
КонецПроцедуры
//231030 Степан --
